- name: ecs.version
  type: keyword
- name: event.module
  type: constant_keyword
  value: ai_sentinel
- name: event.dataset
  type: constant_keyword
  value: ai_sentinel.findings
- name: event.kind
  type: keyword
- name: event.category
  type: keyword
- name: event.type
  type: keyword
- name: event.action
  type: keyword
- name: event.outcome
  type: keyword
- name: event.severity
  type: long
- name: event.risk_score
  type: float
- name: event.original
  type: keyword
  index: false
  doc_values: false
- name: tags
  type: keyword
- name: observer.vendor
  type: constant_keyword
  value: AI Sentinel
- name: observer.product
  type: constant_keyword
  value: AI Sentinel
- name: observer.type
  type: constant_keyword
  value: endpoint
- name: host.name
  type: keyword
- name: host.id
  type: keyword
- name: host.os.type
  type: keyword
- name: process.name
  type: keyword
- name: process.executable
  type: keyword
- name: process.command_line
  type: wildcard
- name: process.pid
  type: long
- name: process.parent.name
  type: keyword
- name: user.name
  type: keyword
- name: file.path
  type: keyword
- name: file.name
  type: keyword
- name: destination.ip
  type: ip
- name: destination.address
  type: keyword
- name: destination.domain
  type: keyword
- name: destination.port
  type: long
- name: source.ip
  type: ip
- name: source.port
  type: long
- name: network.protocol
  type: keyword
- name: network.transport
  type: keyword
- name: dns.question.name
  type: keyword
- name: related.hosts
  type: keyword
- name: related.ip
  type: ip
- name: related.user
  type: keyword
